# Example 1

### Measure of central tendency

In [64]:
#created the list into a table format
import pandas as pd
A=pd.DataFrame(data={'values': [1,2,3,1,2,3,4,2,3,5,6,7,8,8,9,8]})
A

    values
0        1
1        2
2        3
3        1
4        2
5        3
6        4
7        2
8        3
9        5
10       6
11       7
12       8
13       8
14       9
15       8

In [65]:
#mean using pandas
A.mean()

# To show answer

values    4.5
dtype: float64

In [66]:
A.describe()

          values
count  16.000000
mean    4.500000
std     2.780887
min     1.000000
25%     2.000000
50%     3.500000
75%     7.250000
max     9.000000

In [67]:
#median
#using pandas
A.median()

values    3.5
dtype: float64

In [68]:
A.describe()

          values
count  16.000000
mean    4.500000
std     2.780887
min     1.000000
25%     2.000000
50%     3.500000
75%     7.250000
max     9.000000

In [69]:
#using pandas
A.mode()

   values
0       2
1       3
2       8

### Measure of Dispersion

In [70]:
#variance
A.var()

values    7.733333
dtype: float64

In [71]:
#using pandas
A.std()

values    2.780887
dtype: float64

# 5 number Summary


Minimum


1st quartile -Q1


2nd quartile -Q2(Median)



3rd quartile -Q3


Maximum

In [72]:
#Minimum using pandas

A.min()

values    1
dtype: int64

In [73]:
#quartiles using pandas

A.quantile([0.25,0.50,0.75])

      values
0.25    2.00
0.50    3.50
0.75    7.25

In [74]:
A.describe()

          values
count  16.000000
mean    4.500000
std     2.780887
min     1.000000
25%     2.000000
50%     3.500000
75%     7.250000
max     9.000000

In [75]:
#Maximum using pandas

A.max()

values    9
dtype: int64

In [76]:
#Range

#using pandas
Range = A.max()-A.min()
Range

values    8
dtype: int64

In [77]:
#IQR

#using pandas
iqr=A.quantile(0.75)-A.quantile(0.25)
iqr

values    5.25
dtype: float64

# Example 2:

In [78]:
import pandas as pd
A=pd.DataFrame(data={'values': [1,2,3,1,2,3,4,2,3,5,6,7,8,8,9,8,9,10]})
A

    values
0        1
1        2
2        3
3        1
4        2
5        3
6        4
7        2
8        3
9        5
10       6
11       7
12       8
13       8
14       9
15       8
16       9
17      10

In [79]:
#mean using pandas
A.mean()

values    5.055556
dtype: float64

In [80]:
#median using pandas
A.median()

values    4.5
dtype: float64

In [81]:
#mode using pandas
A.mode()

   values
0       2
1       3
2       8

In [82]:
# Measure of Dispersion

In [83]:
#variance using pandas
A.var()

values    9.46732
dtype: float64

In [84]:
#standard deviation using pandas
A.std()

values    3.076901
dtype: float64

In [85]:
#Minimum using pandas

A.min()

values    1
dtype: int64

In [86]:
#quartiles using pandas

A.quantile([0.25,0.50,0.75])

      values
0.25    2.25
0.50    4.50
0.75    8.00

In [87]:
A.describe()

          values
count  18.000000
mean    5.055556
std     3.076901
min     1.000000
25%     2.250000
50%     4.500000
75%     8.000000
max    10.000000

In [88]:
#Maximum using pandas

A.max()

values    10
dtype: int64

In [89]:
#Range

#using pandas
Range = A.max()-A.min()
Range

values    9
dtype: int64

In [90]:
#IQR

#using pandas
iqr=A.quantile(0.75)-A.quantile(0.25)
iqr

values    5.75
dtype: float64

# Example 3:

In [91]:
import pandas as pd
A=pd.DataFrame(data={'values': [1,2,3,1,2,3,4,2,3,5,6,7,8,8,9,8,9,10,11,23]})
A

    values
0        1
1        2
2        3
3        1
4        2
5        3
6        4
7        2
8        3
9        5
10       6
11       7
12       8
13       8
14       9
15       8
16       9
17      10
18      11
19      23

In [92]:
#Measure of central tendency

#mean using pandas
A.mean()

values    6.25
dtype: float64

In [93]:
#median using pandas
A.median()

values    5.5
dtype: float64

In [94]:
#mode using pandas
A.mode()

   values
0       2
1       3
2       8

In [95]:
# Measure of Dispersion

#variance using pandas
A.var()

values    25.776316
dtype: float64

In [96]:
#standard deviation using pandas
A.std()

values    5.077038
dtype: float64

In [97]:
#Minimum using pandas

A.min()

values    1
dtype: int64

In [98]:
#quartiles using pandas

A.quantile([0.25,0.50,0.75])

      values
0.25    2.75
0.50    5.50
0.75    8.25

In [99]:
A.describe()

          values
count  20.000000
mean    6.250000
std     5.077038
min     1.000000
25%     2.750000
50%     5.500000
75%     8.250000
max    23.000000

In [100]:

#Maximum using pandas

A.max()

values    23
dtype: int64

In [101]:
#Range

#using pandas
Range = A.max()-A.min()
Range

values    22
dtype: int64

In [102]:
#IQR

#using pandas
iqr=A.quantile(0.75)-A.quantile(0.25)
iqr

values    5.5
dtype: float64

# Example 4:

In [103]:
import pandas as pd
A=pd.DataFrame(data={'values': [1,2,3,1,2,3,4,2,3,5,6,7,8,8,9,8,9,10,11,23,23,23,24]})
A

    values
0        1
1        2
2        3
3        1
4        2
5        3
6        4
7        2
8        3
9        5
10       6
11       7
12       8
13       8
14       9
15       8
16       9
17      10
18      11
19      23
20      23
21      23
22      24

In [104]:
#Measure of central tendency

#mean using pandas
A.mean()

values    8.478261
dtype: float64

In [105]:
#median using pandas
A.median()

values    7.0
dtype: float64

In [106]:
#mode using pandas
A.mode()

   values
0       2
1       3
2       8
3      23

In [107]:
# Measure of Dispersion

#variance using pandas
A.var()

values    56.897233
dtype: float64

In [108]:
#standard deviation using pandas
A.std()

values    7.543025
dtype: float64

In [109]:
#Minimum using pandas

A.min()

values    1
dtype: int64

In [110]:
#quartiles using pandas

A.quantile([0.25,0.50,0.75])

      values
0.25     3.0
0.50     7.0
0.75     9.5

In [111]:

A.describe()

          values
count  23.000000
mean    8.478261
std     7.543025
min     1.000000
25%     3.000000
50%     7.000000
75%     9.500000
max    24.000000

In [112]:
#Maximum using pandas

A.max()

values    24
dtype: int64

In [113]:
#Range

#using pandas
Range = A.max()-A.min()
Range

values    23
dtype: int64

In [114]:
#IQR

#using pandas
iqr=A.quantile(0.75)-A.quantile(0.25)
iqr

values    6.5
dtype: float64

# Example 5:

In [115]:
import pandas as pd
A=pd.DataFrame(data={'values': [1,2,3,1,2,3,4,2,3,5,6,7,8,8,9,8,9,10,11,23,23,23,24,30,35]})
A

    values
0        1
1        2
2        3
3        1
4        2
5        3
6        4
7        2
8        3
9        5
10       6
11       7
12       8
13       8
14       9
15       8
16       9
17      10
18      11
19      23
20      23
21      23
22      24
23      30
24      35

In [116]:
#Measure of central tendency

#mean using pandas
A.mean()

values    10.4
dtype: float64

In [117]:
#median using pandas
A.median()

values    8.0
dtype: float64

In [118]:
#mode using pandas
A.mode()

   values
0       2
1       3
2       8
3      23

In [119]:
# Measure of Dispersion

#variance using pandas
A.var()

values    96.916667
dtype: float64

In [120]:
#standard deviation using pandas
A.std()

values    9.844626
dtype: float64

In [121]:
#Minimum using pandas

A.min()

values    1
dtype: int64

In [122]:
#quartiles using pandas

A.quantile([0.25,0.50,0.75])

      values
0.25     3.0
0.50     8.0
0.75    11.0

In [123]:

A.describe()

          values
count  25.000000
mean   10.400000
std     9.844626
min     1.000000
25%     3.000000
50%     8.000000
75%    11.000000
max    35.000000

In [124]:
#Maximum using pandas

A.max()

values    35
dtype: int64

In [125]:
#Range

#using pandas
Range = A.max()-A.min()
Range

values    34
dtype: int64

In [126]:
#IQR

#using pandas
iqr=A.quantile(0.75)-A.quantile(0.25)
iqr

values    8.0
dtype: float64

# Example 6:

In [127]:
import pandas as pd
A=pd.DataFrame(data={'values': [1,2,3,1,2,3,4,2,3,5,6,7,8,8,9,8,9,10,11,23,23,23,24,30,35,50,50,50,50]})
A

    values
0        1
1        2
2        3
3        1
4        2
5        3
6        4
7        2
8        3
9        5
10       6
11       7
12       8
13       8
14       9
15       8
16       9
17      10
18      11
19      23
20      23
21      23
22      24
23      30
24      35
25      50
26      50
27      50
28      50

In [128]:
#Measure of central tendency

#mean using pandas
A.mean()

values    15.862069
dtype: float64

In [129]:
#median using pandas
A.median()

values    8.0
dtype: float64

In [130]:
#mode using pandas
A.mode()

   values
0      50

In [131]:
# Measure of Dispersion

#variance using pandas
A.var()

values    276.194581
dtype: float64

In [132]:
#standard deviation using pandas
A.std()

values    16.619103
dtype: float64

In [133]:
#Minimum using pandas

A.min()

values    1
dtype: int64

In [134]:
#quartiles using pandas

A.quantile([0.25,0.50,0.75])

      values
0.25     3.0
0.50     8.0
0.75    23.0

In [135]:
A.describe()

          values
count  29.000000
mean   15.862069
std    16.619103
min     1.000000
25%     3.000000
50%     8.000000
75%    23.000000
max    50.000000

In [136]:
#Maximum using pandas

A.max()

values    50
dtype: int64

In [137]:
#Range

#using pandas
Range = A.max()-A.min()
Range

values    49
dtype: int64

In [138]:
#IQR

#using pandas
iqr=A.quantile(0.75)-A.quantile(0.25)
iqr

values    20.0
dtype: float64

# Example 7:

In [139]:
import pandas as pd
G=pd.DataFrame(data={'values': [1,2,3,1,2,3,4,2,3,5,6,7,8,8,9,8,9,10,11,23,23,23,24,30,35,50,50,50,50]})
G

    values
0        1
1        2
2        3
3        1
4        2
5        3
6        4
7        2
8        3
9        5
10       6
11       7
12       8
13       8
14       9
15       8
16       9
17      10
18      11
19      23
20      23
21      23
22      24
23      30
24      35
25      50
26      50
27      50
28      50

In [140]:
#Measure of central tendency

#mean using pandas
G.mean()

values    15.862069
dtype: float64

In [141]:
#median using pandas
G.median()

values    8.0
dtype: float64

In [142]:
#mode using pandas
G.mode()

   values
0      50

In [143]:
# Measure of Dispersion

#variance using pandas
G.var()

values    276.194581
dtype: float64

In [144]:
#standard deviation using pandas
G.std()

values    16.619103
dtype: float64

In [145]:
#Minimum using pandas

G.min()

values    1
dtype: int64

In [146]:
#quartiles using pandas

G.quantile([0.25,0.50,0.75])

      values
0.25     3.0
0.50     8.0
0.75    23.0

In [147]:
G.describe()

          values
count  29.000000
mean   15.862069
std    16.619103
min     1.000000
25%     3.000000
50%     8.000000
75%    23.000000
max    50.000000

In [148]:

#Maximum using pandas

G.max()

values    50
dtype: int64

In [149]:
#Range

#using pandas
Range = G.max()-G.min()
Range

values    49
dtype: int64

In [150]:
#IQR

#using pandas
iqr=G.quantile(0.75)-G.quantile(0.25)
iqr

values    20.0
dtype: float64

# Example 8:

In [151]:
import pandas as pd
G=pd.DataFrame(data={'values': [1,2,3,1,2,3,4,2,3,5,6,7,8,8,9,8,9,10,11,23,23,23,24,30,35,50,50,50,50,100]})
G

    values
0        1
1        2
2        3
3        1
4        2
5        3
6        4
7        2
8        3
9        5
10       6
11       7
12       8
13       8
14       9
15       8
16       9
17      10
18      11
19      23
20      23
21      23
22      24
23      30
24      35
25      50
26      50
27      50
28      50
29     100

In [152]:
#Measure of central tendency

#mean using pandas
G.mean()

values    18.666667
dtype: float64

In [153]:
#median using pandas
G.median()

values    8.5
dtype: float64

In [154]:
#mode using pandas
G.mode()

   values
0      50

In [155]:
# Measure of Dispersion

#variance using pandas
G.var()

values    502.643678
dtype: float64

In [156]:
#standard deviation using pandas
G.std()

values    22.419716
dtype: float64

In [157]:
#Minimum using pandas

G.min()

values    1
dtype: int64

In [158]:
#quartiles using pandas

G.quantile([0.25,0.50,0.75])

      values
0.25    3.25
0.50    8.50
0.75   23.75

In [159]:
G.describe()

           values
count   30.000000
mean    18.666667
std     22.419716
min      1.000000
25%      3.250000
50%      8.500000
75%     23.750000
max    100.000000

In [160]:
#Maximum using pandas

G.max()

values    100
dtype: int64

In [161]:
#Range

#using pandas
Range = G.max()-G.min()
Range

values    99
dtype: int64

In [162]:
#IQR

#using pandas
iqr=G.quantile(0.75)-G.quantile(0.25)
iqr

values    20.5
dtype: float64